
#Область ПрограммныйИнтерфейс
//+++Захарова: ДополнительныйОбщийМодуль вызывается в Общем Модуле "ПодключаемыеКоманды.ПриСозданииНаСервере".

//Добавить дополнительные реквизиты и команду в зависимости от выбранного документа
Процедура ДоработатьФормыДокументов(Форма) Экспорт
//Добавить дополнительные реквизиты и команду в зависимости от выбранного документа
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитПолеКонтактноеЛицоНаФормуПередОснование(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
	
КонецПроцедуры

//---Захарова
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//+++Захарова: Дополнительные СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
//Добавить НовоеПолеВвода на Формы Документов "ЗаказПокупателя", "ПоступлениеТоваровУслуг","РеализацияТоваровУслуг"
	
	НовоеПолеВвода =Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	НовоеПолеВвода_Вид_ПутьКДанным(НовоеПолеВвода);
	
КонецПроцедуры

Процедура ВставитПолеКонтактноеЛицоНаФормуПередОснование(Форма)
//Добавить НовоеПолеВвода на Форму Документа "ОплатаОтПокупателя"
	
	НовоеПолеВвода = Форма.Элементы.Вставить("ДЗ_КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.Основание);
	НовоеПолеВвода_Вид_ПутьКДанным(НовоеПолеВвода);
	
КонецПроцедуры

Процедура ВставитПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
//Добавить НовоеПолеВвода на Форму Документа "ОплатаПоставщику"
	
	НовоеПолеВвода = Форма.Элементы.Вставить("ДЗ_КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента);
	НовоеПолеВвода_Вид_ПутьКДанным(НовоеПолеВвода);
	
КонецПроцедуры

Процедура НовоеПолеВвода_Вид_ПутьКДанным(НовоеПолеВвода)
//Устанавить Вид и ПутьКДанным для НовоеПолеВвода "КонтактноеЛицо"
	
	НовоеПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 
	НовоеПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры

//---Захарова
#КонецОбласти

